Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་མི་འགལ་བས་བྱང་ཆུབ་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཚུལ་ཁྲིམས་ཏེ།
en: (32) They do not contradict dependent origination and therefore adhere to a discipline that accords with awakening.

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Lord of the kiṃnaras, those are the thirty-two ways in which the bodhisattvas’ perfection of discipline is pure.

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: “Lord of the kiṃnaras, there are thirty-two ways in which the bodhisattvas’ perfection of patience is pure.

source: འདི་ལྟ་སྟེ། ལུས་ལ་མི་ལྟ་བས་བཟོད་པར་བལྟ་བ་དང་། སྲོག་ལ་མི་ཆགས་པར་བཟོད་པར་བལྟ་བ་དང་། ཞེ་སྡང་བའི་སེམས་མེད་པར་བཟོད་པར་བལྟ་བ་དང་། ཉེས་པར་སྨྲས་པའི་ཚིག་དང་དུ་ལེན་པས་བཟོད་པར་བལྟ་བ་དང་།
en: They are as follows: (1) They observe patience without concern for their bodies. (2) They observe patience without being attached to their lives. (3) They observe patience with a mind devoid of anger. (4) They observe patience by accepting slander.

source: ཉམ་ཆུང་བའི་སེམས་ཅན་ལ་སྙིང་རྗེ་སྐྱེད་པས་བཟོད་པར་བལྟ་བ་དང་། མ་བསླབས་པ་ལ་མི་བརྙས་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (5) They observe patience by giving rise to compassion toward beings that are weak. (6) They observe patience without contempt for those who are not trained.

source: གནོད་པ་བྱེད་པ་རྣམས་ལ་ལན་གླན་པའི་མཐུ་ཡོད་ཀྱང་ལན་མི་ལྡོན་པས་བཟོད་པར་བལྟ་བ་དང་། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་བཅད་ཀྱང་མི་འཁྲུགས་ཤིང་གནོད་སེམས་མེད་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (7) They observe patience by not reacting to those who cause them harm, even though they may have the power to do so. (8) They observe patience by remaining undisturbed and free from ill will, even when all the major and minor parts of their body are cut off.

source: བརླང་བ་མེད་པས་བཟོད་པར་བལྟ་བ་དང་། གཤེ་བ་ལ་སླར་མི་གཤེ་བས་བཟོད་པར་བལྟ་བ་དང་། བསམ་པ་དག་པས་བཟོད་པར་བལྟ་བ་དང་། རྙོག་པའི་སེམས་མེད་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (9) They observe patience by not being harsh toward others. (10) They observe patience by not returning the abuse when they are scolded. (11) They observe patience with a pure attitude. (12) They observe patience with a pure intention.

source: དཀྲུགས་པའི་སེམས་མེད་པས་བཟོད་པར་བལྟ་བ་དང་། གཞན་གྱི་སེམས་བསྲུང་བས་བཟོད་པར་བལྟ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་དངོས་པོས་བཟོད་པར་བལྟ་བ་དང་། སྙིང་རྗེའི་བློ་དང་ལྡན་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (13) They observe patience with an unshakeable mind. (14) They observe patience by protecting the minds of others. (15) They observe patience by providing all beings with beneficial things. (16) They observe patience with a compassionate mind.

source: ང་རྒྱལ་མེད་པས་བཟོད་པར་བལྟ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བརྙས་ཐབས་མེད་ཅིང་འདུད་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (17) They observe patience without pride. (18) They observe patience without contempt for anyone but with respect for all sentient beings.

source: འབར་བ་མེད་པས་བཟོད་པར་བལྟ་བ་དང་། ཉེ་བར་ཞི་བས་བཟོད་པར་བལྟ་བ་དང་། ངེས་པར་སེམས་པས་བཟོད་པར་བལྟ་བ་དང་། བདག་གི་འཁྲུལ་པ་ལ་སོ་སོར་རྟོག་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (19) They observe patience without being consumed by the fire of afflictions. (20) They observe patience with a peaceful mind. (21) They observe patience with reflection. (22) They observe patience by investigating their own confusion.

source: གཞན་གྱི་འཁྲུལ་པའི་སྐྱོན་ལ་མི་ལྟ་བས་བཟོད་པར་བལྟ་བ་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམས་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (23) They observe patience without considering the confused faults of others. (24) They observe patience by training in the recollection of the Buddha.

source: ཆོས་ལ་སེམས་སྦྱོར་བས་བཟོད་པར་བལྟ་བ་དང་། དང་བའི་དངོས་པོས་བཟོད་པར་བལྟ་བ་དང་། སེམས་ལ་གདུང་བ་མེད་པས་བཟོད་པར་བལྟ་བ་དང་། བཞིན་འཛུམ་ཞིང་ཁྲོ་གཉེར་མེད་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (25) They observe patience by directing their minds toward the Dharma. (26) They observe patience with faith. (27) They observe patience with a mind free from torment. (28) They observe patience with a smile and without frowning.

source: གསོང་པོ་སྨྲ་བས་བཟོད་པར་བལྟ་བ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་དངང་བ་མེད་པས་བཟོད་པར་བལྟ་བ་དང་།
en: (29) They observe patience by speaking honestly. (30) They observe patience without being frightened by the three gateways to liberation.

source: མ་སྐྱེས་པ་དང་མ་བྱུང་བ་ལ་མོས་པས་བཟོད་པར་བལྟ་བ་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པས་བཟོད་པར་བལྟ་བ་སྟེ།
en: (31) They observe patience with conviction in the absence of birth and origination. (32) They observe patience after having reached acceptance of the unborn nature of phenomena.

source: མིའམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Lord of the kiṃnaras, those are the thirty-two ways in which the bodhisattvas’ perfection of patience is pure.

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: “Lord of the kiṃnaras, there are thirty-two ways in which the bodhisattvas’ perfection of diligence is pure.

source: འདི་ལྟ་སྟེ། མི་འམ་ཅིའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་རིགས་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། ཆོས་ཀྱི་རིགས་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། དགེ་འདུན་གྱི་རིགས་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: Lord of the kiṃnaras, they are as follows: (1) Bodhisattvas engender diligence to perpetuate the family of the Buddha. (2) They engender diligence to perpetuate the family of the Dharma. (3) They engender diligence to perpetuate the family of the Saṅgha.

source: སེམས་ཅན་ཚད་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། འཁོར་བ་ཚད་མེད་པ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། སངས་རྒྱས་ཚད་མེད་པ་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། དགེ་བའི་རྩ་བ་ཚད་མེད་པ་བསགས་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། ཐོས་པ་ཚད་མེད་པ་གཟུང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (4) They engender diligence to ripen countless sentient beings. (5) They engender diligence to embrace limitless saṃsāra. (6) They engender diligence to worship and revere countless buddhas. (7) They engender diligence to gather infinite roots of virtue. (8) They engender diligence to acquire infinite learning.

source: !སེམས་ཅན་ཐམས་ཅད་ལ་ལེགས་པར་སྨྲ་བ་སྨྲ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་རབ་ཏུ་གདིང་བར་བྱེད་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱ་བ་ཅི་ཡོད་ཅེས་བྱ་བ་ལ་སྤྲོ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (9) They engender diligence to speak to all beings using the right words. (10) They engender diligence to eliminate the distress of all beings. (11) They engender diligence to enthusiastically assist all sentient beings. (12) They engender diligence to never abandon any being.

source: སེམས་ཅན་ཐམས་ཅད་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་ལ་གཟུད་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། བཟོད་པའི་སྟོབས་ཐམས་ཅད་དང་། དེས་པ་མི་ཉམས་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་བསྐྱེད་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། ཆགས་པ་མེད་པའི་ཤེས་རབ་མཆོག་ཡོངས་སུ་བསྐང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (13) They engender diligence to induct all beings into the training of discipline. (14) They engender diligence so that the power of their patience and the gentleness of their nature never diminish. (15) They engender diligence to give rise to all forms of concentrations, liberations, absorptions, and attainments. (16) They engender diligence to perfect supreme insight devoid of attachment.

source: བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཚངས་པའི་གནས་པའི་གནས་པ་ཡོངས་སུ་བསྐང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (17) They engender diligence to perfect the four pure abodes—love, compassion, joy, and equanimity.

source: མངོན་པར་ཤེས་པ་ཐམས་ཅད་ལ་བརྩོན་འགྲུས་བསྐྱེད་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (18) They engender diligence to generate effort related to all the higher perceptions.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པ་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་བསྡུ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (19) They engender diligence to attain their own buddha realms in which the qualities of all the buddha realms are arrayed.

source: བདུད་ཐམས་ཅད་གཞོམ་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། སྟོབས་བརྟན་པ་ཆེན་པོས་ཕ་རོལ་གནོན་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ཚར་གཅད་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (20) They engender diligence to defeat all demonic forces. (21) They engender diligence to suppress opposition with great and stable strength. (22) They engender diligence to overcome all opponents in accordance with the Dharma.

source: སྟོབས་བཅུ་དང་མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྐང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། ལུས་དང་ངག་དང་སེམས་ཀྱི་རྒྱན་གྱི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (23) They engender diligence to perfect the ten powers, the fearlessnesses, and the other buddha qualities. (24) They engender diligence to actualize the ornaments of body, speech, and mind.

source: བྱ་བ་ཐམས་ཅད་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་ཅིང་བརྩོན་པ་མི་གཏོང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (25) They engender diligence to master all activities and to never let go of their efforts.

source: སེམས་ཞུམ་པ་མེད་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (26) They engender diligence to never become disheartened. (27) They engender diligence to remain unaffected by all the afflictions.

source: མ་རྒལ་བ་སྒྲོལ། མ་གྲོལ་བ་དགྲོལ། དབུགས་མ་ཕྱིན་པ་དབུགས་དབྱུང་། ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (28) They engender diligence to free those who have not crossed over, to liberate those who are not liberated, to provide relief to those who have not found relief, and to cause those who have not passed beyond suffering to pass beyond suffering.

source: བསོད་ནམས་བརྒྱ་པའི་མཚན་གྱི་ཚོགས་བསགས་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (29) They engender diligence to gather the marks of a hundred forms of merit.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (30) They engender diligence to uphold the sacred Dharma of all the buddhas.

source: སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་རྫུ་འཕྲུལ་གྱིས་འགྲོ་ཞིང་སངས་རྒྱས་ལ་བལྟ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: (31) They engender diligence to travel miraculously to an infinite number of buddha realms and to behold those buddhas.

source: སེམས་དང་ལུས་དབེན་པའི་ཕྱིར་དེའི་བརྩོན་འགྲུས་དེ་དབེན་པ་ལས་ངེས་པར་བྱུང་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་འཇུག་པའི་ཕྱིར་དེའི་བརྩོན་འགྲུས་དེ་བླང་བ་མེད་ཅིང་དོར་བ་མེད་ལ། གདེག་པ་མེད་ཅིང་གཞག་པ་མེད་དེསྐྱེ་བ་མེད་ཅིང་འབྱུང་བ་མེད་པས་བསྡུས་པ་ཡིན་ཏེ།
en: (32) They engender diligence to disengage their minds and bodies and to reach the freedom and omniscient wisdom that come from disengagement—this is subsumed in the absence of adoption and rejection, the absence of lifting and placing, and the absence of birth and origination.

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Lord of the kiṃnaras, those are the thirty-two ways in which the bodhisattvas’ perfection of diligence is pure.

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: “Lord of the kiṃnaras, there are thirty-two ways in which the bodhisattvas’ perfection of concentration is pure.

source: དྲན་པ་ཡོངས་སུ་དག་པ་དང་། བློ་གྲོས་ཡོངས་སུ་དག་པ་དང་། རྟོགས་པ་ཡོངས་སུ་དག་པ་དང་། ངོ་ཚ་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། ཁྲེལ་ཡོད་པ་ཡོངས་སུ་དག་པ་དང་། མོས་པ་ཡོངས་སུ་དག་པ་དང་། བསྔོ་བ་ཡོངས་པོ་སུ་དག་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗོད་པ་ཡོངས་སུ་དག་པ་དང་། དབང་པོ་སྦས་པ་ཡོངས་སུ་དག་པ་དང་། མི་གནས་པ་ཡོངས་སུ་དག་པ་དང་། དེ་ལ་མ་ཆགས་པ་ཡོངས་སུ་དག་པ་དང་། མངོན་པར་ཤེས་པ་བསྐྱེད་པ་ཡོངས་སུ་དག་པ་དང་། སེམས་ལས་སུ་རུང་བ་ཡོངས་སུ་དག་པ་དང་། ལུས་དབེན་པ་ཡོངས་སུ་དག་པ་དང་། བྲག་ཅ་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། ནང་ཉེ་བར་ཞི་བ་ཡོངས་སུ་དག་པ་དང་། ཕྱི་རོལ་དུ་མི་རྒྱུ་བ་ཡོངས་སུ་དག་པ་དང་། དམིགས་པའི་ལྟ་བ་སྤོང་བ་ཡོངས་སུ་དག་པ་དང་། བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པར་སོ་སོར་རྟོག་ཅིང་ཁམས་གསུམ་པ་ལ་མི་གནས་པ་ཡོངས་སུ་དག་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་སྒོ་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་ལ་ལྟ་བའི་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་ལ་འཇུག་པས་རབ་རིབ་མེད་ཅིང་སྣང་བ་ཡོངས་སུ་དག་པ་དང་། རྒྱུ་དང་། འབྲས་བུ་དང་། རྣམ་པར་སྨིན་པ་དང་མི་འགལ་བ་ཡོངས་སུ་དག་པ་དང་། ཆོས་ལ་སེམས་པའི་བཟོད་པ་ཡོངས་སུ་དག་པ་དང་། ཚུལ་བཞིན་གྱི་རྣམ་པའི་ཆོས་ལ་སོ་སོར་རྟོག་པ་ཡོངས་སུ་དག་པ་དང་། ཐབས་ལ་མཁས་པ་བསྡུ་བ་ཡོངས་སུ་དག་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་བསྒྲུབ་པ་ཡོངས་སུ་དག་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་མ་འདྲེས་པ་ཡོངས་སུ་དག་པ་དང་། མི་གཡོ་བའི་བསམ་གཏན་བསྒྲུབ་པ་ཡོངས་སུ་དག་པ་དང་། སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་ཐོབ་པ་ལ་མི་གཡེང་བ་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་ལྟ་བ་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོའི་མཆོག་དང་། མཆོག་མ་ཡིན་པ་ཤེས་ནས་སོ་སོར་ཅི་རིགས་པར་ཆོས་སྟོན་པ་ཡོངས་སུ་དག་པ་སྟེ།
en: They are (1) the purity of mindfulness, (2) the purity of intelligence, (3) the purity of realization, (4) the purity of modesty, (5) the purity of humility, (6) the purity of trust, (7) the purity of dedication, (8) the purity consisting in not forgetting about the mind set on awakening, (9) the purity of hidden faculties, (10) the purity of nonabiding, (11) the purity of the absence of attachment, (12) the purity of the generation of higher perception, (13) the purity of a flexible mind, (14) the purity of physical isolation, (15) the purity consisting in knowing phenomena to be like echoes, (16) the purity of inner peace, (17) the purity consisting in not wandering outside, (18) the purity of abandoning apprehending views, (19) the purity of understanding the absence of self, sentient being, life principle, individuality, and person, and of not dwelling in the three realms, (20) the purity of the gateway of the branches of awakening, (21) the purity of the compassion that cares for sentient beings, (22) the purity of unobstructed vision induced by the attainment of insight, (23) the purity of not being in conflict with the principles of causes, effects, and karmic ripening, (24) the purity of acceptance that considers the Dharma, (25) the purity of the proper discernment of phenomena, (26) the purity of the development of skill in means, (27) the purity of the accomplishment of the essence of awakening, (28) the purity of the absence of association with the hearers and solitary buddhas, (29) the purity of the accomplishment of unwavering concentration, (30) the purity of the absence of distraction with respect to the attainment of the absorption of the buddhas, (31) the purity of the perception of the mental states and conduct of all beings, and (32) the purity consisting in knowing which sentient beings are of higher faculties and which are not, and in teaching the Dharma to them accordingly.

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས། བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Lord of the kiṃnaras, those are the thirty-two ways in which the bodhisattvas’ perfection of concentration is pure.

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: “Lord of the kiṃnaras, there are thirty-two ways in which the bodhisattvas’ perfection of insight is pure.

source: ཐོས་པ་ཚོལ་བས་མི་ངོམས་པས་མང་དུ་ཐོས་པ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པས་ཆོས་རྣམས་ལ་དཔྱོད་པའི་ཤེས་པ་ལ་མཁས་པ་དང་།
en: (1) They have erudition acquired through insatiability in the pursuit of learning. (2) They are experts in the knowledge that investigates phenomena with proper focus.

source: བྱང་ཆུབ་མངོན་སུམ་དུ་བྱེད་པའི་བདག་ཉིད་ཆོས་བསྒྲུབ་པ་ཤེས་པ་དང་། ཕུང་པོ་ལ་མཁས་པ་ལ་འཇུག་པས་རྣམ་པར་གྲོལ་བ་ཤེས་པ་དང་།
en: (3) They understand the way to accomplish the Dharma in order to actualize awakening. (4) They know liberation through expertise in the aggregates.

source: ཆོས་ཀྱི་དབྱིངས་ལ་མཁས་པའི་ཤེས་པ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པའི་ཤེས་པ་དང་། རྒྱུ་དང་བྱ་བ་ཁོང་དུ་ཆུད་པས་སྟོང་པའི་རྣམ་པར་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པ་དང་།
en: (5) They have expert knowledge of the realm of phenomena. (6) They have expert knowledge of the sense sources. (7) They are experts in dependent origination as an attribute of emptiness, because of comprehending causes and actions.

source: བདེན་པ་ལ་མཁས་པའི་ཤེས་པ་དང་། དེར་མི་ལྟུང་བར་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ཤེས་པ་དང་། བསམས་བཞིན་དུ་སྐྱེ་བས་སྐྱེ་བ་ལ་སོ་སོར་མི་རྟོག་པའི་ཤེས་པ་དང་། གཟོད་མ་ནས་རྣམ་པར་དག་པས་ཆོས་ཐམས་ཅད་མི་སྐྱེ་བར་ཤེས་པ་དང་།
en: (8) They have expert knowledge of the truth. (9) They have knowledge that understands the faultless state without falling into it. (10) They have knowledge that does not conceptualize birth, due to taking intentional rebirth. (11) They understand that phenomena are primordially pure and thus unborn.

source: ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་སེམས་ཅན་ཐམས་ཅད་བདག་མེད་པར་ཤེས་པ་དང་།
en: (12) They understand that mistaken views generate karmic ripening and that all beings are therefore selfless.

source: འདོད་ཆགས་དང་བྲལ་བའི་མཐའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཆོས་གཅིག་ཏུ་ཤེས་པ་དང་།
en: (13) They understand that all phenomena are one, due to the limit free from desire.

source: ནམ་མཁའ་དང་མཚུངས་པའི་ཕྱིར་ཞིང་ཐམས་ཅད་ཞིང་གཅིག་ཏུ་ཤེས་པ་དང་།
en: (14) They understand that all universes are one, because they are identical to space.

source: ཆོས་ཀྱི་དབྱིངས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ཞུགས་པས་སངས་རྒྱས་ཐམས་ཅད་སངས་རྒྱས་གཅིག་ཏུ་ཤེས་པ་དང་།
en: (15) They understand that all buddhas are one, because they are immersed in the inconceivable realm of phenomena.

source: ཡི་གེ་ཤེས་པ་ལ་མཁས་པས་ཆོས་ཀྱི་ཚིག་རབ་ཏུ་དབྱེ་བ་བསྟན་པ་ཤེས་པ་དང་། ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པའི་ཕྱིར་ཆགས་པ་མེད་པའི་སྤོབས་པས་ཆོས་རྒྱ་ཆེར་ཤེས་པ་དང་།
en: (16) They understand how to teach the distinctions of Dharma terms through expertise in the knowledge of letters. (17) They have extensive knowledge of the Dharma supported by unobstructed eloquence in order to satisfy all beings through excellent explanations.

source: ཐོས་པ་ཐམས་ཅད་འཛིན་པས་གཟུངས་བརྗེད་པ་མེད་པའི་ཤེས་པ་དང་།
en: (18) They have the knowledge of perfect recall by retaining all that has been heard.

source: བདུད་དེ་དག་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པས། བདུད་ཀྱི་ལས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པའི་ཤེས་པ་དང་།
en: (19) They have knowledge that comprehends all demonic activities by ripening demonic forces into awakening.

source: རྣམ་པར་བསྒྲུབས་ཏེ་སོ་སོར་ཉེ་བར་གནས་པར་ཤེས་པས་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་རྟོག་པའི་ཤེས་པ་དང་།
en: (20) They have knowledge that understands that all phenomena are illusions by understanding that they are illusory manifestations.

source: ཤིན་ཏུ་ཡོངས་སུ་གྲུབ་པ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་རྨི་ལམ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་དང་། མིག་ཡོར་དང་། བྲག་ཅ་ལྟ་བུའི་ཚུལ་དུ་སྟོན་པ་ཤེས་པ་དང་།
en: (21) They have insight that shows all phenomena to be similar to dreams, mirages, reflections of the moon in water, optical illusions, and echoes, in terms of their lack of establishment.

source: ཤེས་པ་རྣམ་པར་དག་པའི་ཕྱིར་སེམས་ཅན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པའི་ཤེས་པ་དང་།
en: (22) They have insight that comprehends all the mental activities of sentient beings through pure knowledge.

source: ཤིན་ཏུ་བསླབས་པའི་ཕྱིར་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་བརྟགས་པར་ཤེས་པའི་ཐབས་ལ་མཁས་པ་དང་།
en: (23) They have expertise in the knowledge that investigates saṃsāra and nirvāṇa because of their higher training.

source: རྣམ་པར་ཐར་པའི་སྒོའི་ཕྱིར་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པའི་ཆོས་ཤེས་པ་དང་།
en: (24) They have insight into the three gateways to liberation—emptiness, the absence of marks, and the absence of wishes.

source: !གཟོད་མ་ནས་བྲལ་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་། ཉེ་བར་ཞི་བར་ཤེས་པ་དང་།
en: (25) They understand that all phenomena are naturally at peace, calm, and tranquil, since they are primordially beyond meeting.

source: མ་རིག་པ་དང་། གཏི་མུག་གི་མུན་པ་ཀུན་ཏུ་བཅོམ་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མེད་ཅིང་སྣང་བ་ཐོབ་པ་དང་།
en: (26) They have attained the unobstructed vision of all phenomena by eliminating the darkness of ignorance and stupidity.

source: ཆོས་ཐམས་ཅད་གར་ཡང་མི་འགྲོ་གང་ནས་ཀྱང་མི་འོང་བར་ཤེས་པས་ཤེས་རབ་ཀྱི་འོད་དང་ལྡན་ཞིང་སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་ཐར་པའི་ཆོས་སྟོན་པ་དང་།
en: (27) They possess the light of insight by understanding that no phenomena come from or go anywhere, and they teach all beings the Dharma that leads to liberation.

source: ལས་དང་བྱ་བ་ཁོང་དུ་ཆུད་པས་སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་དང་འགྲོ་བར་སྐྱེ་བ་སྟོན་པ་དང་།
en: (28) They display the process of the death and rebirth of beings by understanding action and activities.

source: དོན་དང་ཆོས་དང་ངེས་པའི་ཚིག་དང་སྤོབས་པའི་ཚུལ་ལ་མཁས་ཏེ་ ཕྱད་པར་དེ་ཁོ་ནའི་ལུང་སྟོན་པས། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཐོབ་པ་དང་།
en: (29) They have attained the four correct knowledges through expertise in meaning, phenomena, language, and eloquence, and they continuously and exclusively instruct in that way.

source: བདག་དུལ་བ་དང་། ཞི་བ་དང་། གྲོལ་བ་དང་། སྦས་པ་དང་། བྱང་བས་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བའི་ཕྱིར་དོན་ཡོད་པའི་ཆོས་སྟོན་པ་དང་།
en: (30) They teach the meaningful Dharma that causes one to transcend suffering while being composed, calm, liberated, collected, and learned.

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་དེ་ཤེས་རབ་ལས་ངེས་པར་བྱུང་བར་རིག་ནསཆོས་ཀྱི་གྲོང་ཁྱེར་ཐམས་ཅད་ཡོངས་སུ་སྐྱོང་བར་བྱིན་གྱིས་རློབ་པ་དང་།
en: (31) Upon seeing that emancipation results from insight, they uphold the sacred Dharma and thereby receive the blessings of the blessed buddhas to protect all Dharma cities.

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་ཡང་དག་པར་གཞོལ་ཏེ། མཐའ་ལ་གནས་པའི་ཚུལ་ངེས་པར་བྱས་པས་ལུང་བསྟན་པའི་ས་རབ་ཏུ་ཐོབ་པ་ཡིན་ཏེ།
en: (32) They are genuinely committed to the level of the irreversible bodhisattvas, and they eventually attain the level of prophecy by ascertaining the way things are.

source: མིའམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས། བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Lord of the kiṃnaras, those are the thirty-two ways in which the bodhisattvas’ perfection of insight is pure.

source: མིའམ་ཅིའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་ན་ཐབས་ལ་མཁས་པར་རིག་པར་བྱའོ། །
en: “Lord of the kiṃnaras, you should know that bodhisattvas are skilled in means if they possess thirty-two features.

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་བདག་ཟད་པར་མི་བྱེད་པས་སེམས་ཅན་ལ་ལྟ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བསོད་ནམས་ཆེན་པོ་ལ་གནས་པ་དང་།
en: They are as follows: (1) Bodhisattvas look after beings by not eliminating themselves. (2) They abide by great merit in order to ripen all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྦྱིན་གནས་ཀྱི་ཕྱིར་སྦྱིན་གནས་མི་ཚོལ་བ་དང་། སེམས་ཅན་དབུལ་པོ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རྒྱ་ཆེན་པོ་དོན་དུ་མི་གཉེར་བ་དང་།
en: (3) They do not search for worthy recipients of generosity since all beings are worthy recipients of generosity. (4) They do not hanker after grandeur so that they can ripen destitute beings.

source: སེམས་ཅན་ཐམས་ཅད་ངག་བསྡམ་པ་ལ་སྦྱར་བའི་ཕྱིར། ལྐུགས་པ་དང་། དིག་པ་ལྟ་བུར་སྟོན་པ་དང་། བུད་མེད་དང་བུ་མོ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། བུད་མེད་ཡོངས་སུ་འཛིན་པ་དང་།
en: (5) They manifest as mutes and stutterers to cause all beings to control their speech. (6) They assume the forms of women in order to ripen women and girls.

source: ཁྱེའུ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། ཁྱེའུའི་གཟུགས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་འཐུན་པར་བྱ་བའི་ཕྱིར། གཟུགས་ཐམས་ཅད་སྟོན་པ་དང་།
en: (7) They assume the physical forms of children to ripen children. (8) They assume all types of physical forms to ripen others in the appropriate manner.

source: སེམས་ཅན་མྱོས་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། མྱོས་པ་མ་ཡིན་ཡང་མྱོས་པའི་ལུས་སུ་སྟོན་པ་དང་། དེ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པའི་ཕྱིར། སྨྱོན་པ་དང་སེམས་གཡེངས་པའི་གཟུགས་སུ་སྟོན་པ་དང་།
en: (9) Even though they are not insane, they display that state to ripen insane beings. (10) They assume the physical forms of madmen and disturbed beings to teach the Dharma to those who have such propensities.
